# NoSupported2DElementsToCopyFromView Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CuttingFailures..::..NoSupported2DElementsToCopyFromView Property
BuiltInFailures..::..CuttingFailures Class See Also
---
None of the elements in the view you have selected are supported for the insert 2D operation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoSupported2DElementsToCopyFromView { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoSupported2DElementsToCopyFromView As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoSupported2DElementsToCopyFromView {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CuttingFailures Class
Autodesk.Revit.DB Namespace